Revit 2027 API
ElectricalLoadClassificationSpace Enumeration
 This enum is used by the ElectricalLoadClassification to specify the load class for use with spaces.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ElectricalLoadClassificationSpace
Public Enumeration ElectricalLoadClassificationSpace
public enum class ElectricalLoadClassificationSpace
type ElectricalLoadClassificationSpace
Members
Member name | Value | Description
Lighting | 1
None | 0
Power | 2
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace